{
	"footer.contact.email": "Email address",
	"footer.contact.email_hint": "Where can I reply to?",
	"footer.contact.error.empty.email": "Email is mandatory!",
	"footer.contact.error.empty.message": "Message is mandatory!",
	"footer.contact.error.empty.name": "Name is mandatory!",
	"footer.contact.error.invalid.email": "Email is invalid!",
	"footer.contact.error.server": "Error when sending email!",
	"footer.contact.error.server_apology": "Message sender component is currently not working. Alternatively, you can contact me directly",
	"footer.contact.error.server_apology_link": "here",
	"footer.contact.message": "Message",
	"footer.contact.message_hint": "Type your message ...",
	"footer.contact.name": "Name",
	"footer.contact.name_hint": "Hi, I'm Miha, what's your name?",
	"footer.contact.send": "Send",
	"footer.contact.send_loading": "Sending ...",
	"footer.contact.success": "Message was sent!",
	"footer.contact.title": "Contact",
	"general.btn.back": "Back",
	"index.about": "About",
	"index.content.current": "Currently I am working on these projects",
	"index.content.cv": "After finished elementary school I enrolled into Technical gymnasium at Šolski Center Nova Gorica. During my high school studies, I achieved some prizes in competitions in mathematics, logic, computer science, and computer literacy. I graduated in courses of Slovenian language, Mathematics, Computer science, English language (B2 level) and physics. After Matura exam I enrolled into Faculty of computer and information science, where I study to this day. Because I develop software with great enjoyment, I dedicate a lot of free time to my projects in which I sometimes experiment with new technologies and design patters or simply improving some of the old projects with new ideas. In year 2018 I started to contribute to open-source web framework KumuluzEE. In 2019 I graduated and therefore received a Bachelor's degree of computer and information science (UN classification). After graduation I enrolled in postgraduate program of computer and information science.",
	"index.content.cv_title": "Biography",
	"index.content.short_intro": "I am Miha Jamšek and I study at Faculty of computer and information science at University in Ljubljana. Here you can find my projects and projects I contributed to. Some of them are available for download and in case you wish, to do so, I invite you to download them. On this page you can also find links to my other web profiles.",
	"index.content.tech": "From a technological point of view, I mostly deal with web technologies, backend and frontend. For backend I mostly use platforms Java (KumuluzEE/JavaEE and Spring MVC) and Node.js (Express), while for frontend I use Angular 8. From time to time I also use some Scala, Kotlin, Python, C# on backend and Vue.js and React (with GatsbyJS) on frontend.",
	"index.content.tech_title": "Knowledge",
	"navbar.home": "Home",
	"navbar.logo": "mJamsek",
	"navbar.projects": "Projects",
	"not-found.home": "Go back to",
	"not-found.link": "home",
	"not-found.message": "Page you are looking for does not exists!",
	"not-found.title": "Error 404!",
	"page.projekti.title": "Projects",
	"projects.last-update": "Last update",
	"projects.private_repo": "This repository is private. If you need access, please contact me.",
	"projects.repo": "Repository",
	"projects.title": "Projects",
	"projects.version": "Version"
}
