{
	"header": {
		"about-me": {
			"para": "I am Miha Jamšek, master's student at Faculty of computer and information science at University of Ljubljana. Mostly, I work on developing web solutions and integration of such solutions into bigger. On this site there are presented some of the projects I worked on in the past. The collection includes own projects for passing time, projects developed during studies, projects developed out of need and some more."
		},
		"title": "About me"
	},
	"learn-more": {
		"knowledge": {
			"content": "I mostly develop using web technologies, backend as well as frontend. For developing backend, I mostly use platform Java (KumuluzEE/JakartaEE/MicroProfile), occasionally also Node.js (Express.js). In smaller scale I also used Python (Flask) and Go. When developing frontend, I primarily use Angular, occasionally also React (react-dom, also in combination with GatsbyJS and react-native).",
			"technologies": {
				"backend": {
					"title": "Backend technologies"
				},
				"frontend": {
					"title": "Web technologies"
				},
				"mobile": {
					"title": "Mobile technologies"
				},
				"other": {
					"title": "Other"
				}
			},
			"title": "Knowledge & technologies"
		},
		"references": {
			"content": "After finished elementary school I enrolled into Technical gymnasium at Šolski Center Nova Gorica. During my high school studies, I achieved some prizes in competitions in mathematics, logic, computer science, and computer literacy. I graduated in courses of Slovenian language, Mathematics, Computer science, English language (B2 level) and physics. After Matura exam I enrolled into Faculty of computer and information science, where I study to this day. Because I develop software with great enjoyment, I dedicate a lot of free time to my projects in which I sometimes experiment with new technologies and design patters or simply improving some of the old projects with new ideas. In year 2018 I started to contribute to open-source web framework KumuluzEE. In 2019 I graduated and therefore received a Bachelor's degree of computer and information science (UN classification). After graduation I enrolled in postgraduate program of computer and information science.",
			"items": {
				"kee": {
					"item-1": "Developed library for authentication and authorization using OpenIDConnect protocol",
					"item-2": "Initially written to support only Keycloak, later extended to work with any OIDC provider",
					"item-3": "Published library to Maven Central",
					"title": "Published JavaEE library for authentication"
				},
				"mashery": {
					"item-1": "Developing DevOps tool to synchronize API gateway endpoints with OpenApi definition of a service as part of a CI pipeline.",
					"item-2": "Developing admin dashboard using Angular",
					"item-3": "Contributing to service using KumuluzEE framework",
					"title": "Developing DevOps tool"
				},
				"restclient": {
					"item-1": "Written library for typesafe REST calls in KumuluzEE framework",
					"item-2": "Library written to conform with MicroProfile specifications",
					"title": "Developing library for JavaEE platform"
				}
			},
			"title": "References"
		}
	}
}
